Tekla.Structures.Drawing.DrawingHatchColors
The hatch colors used in Tekla.Structures.Drawing.

Tekla.Structures.Drawing.DrawingHatchColors.Invisible
The light gray color: the "invisible color". Light gray is visible
only on the screen and not in printed or exported drawings.

Tekla.Structures.Drawing.DrawingHatchColors.Black
The black color.

Tekla.Structures.Drawing.DrawingHatchColors.NewLine1
The brown color.

Tekla.Structures.Drawing.DrawingHatchColors.NewLine2
The green color.

Tekla.Structures.Drawing.DrawingHatchColors.NewLine3
The dark blue color.

Tekla.Structures.Drawing.DrawingHatchColors.NewLine4
The forest green color.

Tekla.Structures.Drawing.DrawingHatchColors.NewLine5
The orange color.

Tekla.Structures.Drawing.DrawingHatchColors.NewLine6
The gray color.

Tekla.Structures.Drawing.DrawingHatchColors.Red
The red color.

Tekla.Structures.Drawing.DrawingHatchColors.Green
The bright green color.

Tekla.Structures.Drawing.DrawingHatchColors.Blue
The blue color.

Tekla.Structures.Drawing.DrawingHatchColors.Cyan
The turquoise color.

Tekla.Structures.Drawing.DrawingHatchColors.Yellow
The yellow color.

Tekla.Structures.Drawing.DrawingHatchColors.Magenta
The magenta color.

Tekla.Structures.Drawing.DrawingHatchColors.Special
The special color (deprecated). Defined with advanced options XS_HATCH_SPECIAL_COLOR_R,
XS_HATCH_SPECIAL_COLOR_G and XS_HATCH_SPECIAL_COLOR_B.

Tekla.Structures.Drawing.DrawingHatchColors.Gray30
The Gray30 rgb(0.3, 0.3, 0.3) color.

Tekla.Structures.Drawing.DrawingHatchColors.Gray50
The Gray50 rgb(0.5, 0.5, 0.5) color.

Tekla.Structures.Drawing.DrawingHatchColors.Gray70
The Gray70 rgb(0.7, 0.7, 0.7) color.

Tekla.Structures.Drawing.DrawingHatchColors.Gray90
The Gray90 rgb(0.9, 0.9, 0.9) color.